Revit 2017 API
AppearanceAssetElement Class
 An element that represents an appearance asset for use in composing material definitions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public class AppearanceAssetElement : Element
Visual Basic
Public Class AppearanceAssetElement _
	Inherits Element
Visual C++
public ref class AppearanceAssetElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.AppearanceAssetElement
See Also
AppearanceAssetElement Members
Autodesk.Revit.DB Namespace